Repository: mziodev/Basebook
Catalog: Basebook/Localizable.xcstrings
Source language: en
Languages: es, fr

source: About Basebook
es: Acerca de Basebook
fr: À propos de Basebook

source: An unexpected error occurred, please try again.
es: Ha ocurrido un error inesperado, por favor inténtalo otra vez.
fr: Une erreur inattendue s'est produite, veuillez réessayer.

source: Are you sure you want to clear the history?
es: ¿Estás seguro de que quieres borrar el historial?
fr: Etes-vous sûr de vouloir effacer l'historique ?

source: Basebook logo with an hexagons circle
es: Logotipo de Basebook con un círculo de hexágonos.
fr: Logo Basebook avec un cercle d'hexagones

source: Basebook save every operation on Conversion History so you can come back to them later.
es: Basebook guarda cada operación en el Historial de Conversión para que puedas volver a ellas más tarde.
fr: Basebook enregistre chaque opération dans l'historique des conversions afin que vous puissiez y revenir plus tard.

source: Bases included: Binary, Trinary, Quaternary, Quinary, Senary, Octal, Nonary, Decimal, Duodecimal and Hexadecimal.
es: Bases incluidas: Binaria, Trinaria, Cuaternaria, Quinaria, Senaria, Octal, Nonaria, Decimal, Duodecimal y Hexadecimal.
fr: Bases incluses : Binaire, Trinaire, Quaternaire, Quinaire, Sénaire, Octale, Nonaire, Décimale, Duodécimale et Hexadécimale.

source: Binary
es: Binaria
fr: Binaire

source: Clear
es: Borrar
fr: Supprimer

source: Clear History
es: Borrar Historial
fr: Supprimer l'historique

source: Contact Us
es: Contacta con nosotros
fr: Contactez-nous

source: Continue
es: Continuar
fr: Continuer

source: Conversions
es: Conversiones

source: Convert
es: Convertir
fr: Convertir

source: Every conversion operation is saved in a history store, so you can always go back and check them out!.
es: Cada operación de conversión se guarda en un almacén de historial, por lo que siempre puedes volver atrás y consultarlas.
fr: Chaque opération de conversion est enregistrée dans un historique, vous pouvez donc toujours y revenir et les consulter !

source: From %@ base
es: Desde base %@
fr: À partir de la base %@

source: Gorgeous and easy to use UI with light and dark mode support.
es: Interfaz de usuario magnífica y fácil de usar con soporte para modo claro y oscuro.
fr: Interface utilisateur magnifique et facile à utiliser avec prise en charge des modes clair et sombre.

source: History
es: HIstorial
fr: Historique

source: In this new version, if the input field is empty, the Convert button will be disabled.
es: En esta nueva versión, si el campo de entrada está vacío, el botón Convertir estará desactivado.
fr: Dans cette nouvelle version, si le champ de saisie est vide, le bouton Convertir sera désactivé.

source: Includes the 10 most used bases
es: Incluye las 10 bases más utilizadas
fr: Comprend les 10 bases les plus utilisées

source: Invalid base, please check your base.
es: Base no valida, por favor comprueba tu base.
fr: Base invalide, veuillez vérifier votre base.

source: Invalid number/character for the selected base, please check your number/character.
es: Número/carácter no válido para la base seleccionada, por favor verifica tu número/carácter.
fr: Numéro/caractère invalide pour la base sélectionnée, veuillez vérifier votre numéro/caractère.

source: No history yet
es: Todavía no hay historial
fr: Pas encore d'histoire

source: Nonary
es: Nonaria
fr: Nonaire

source: Now if the history list is empty a 'No conversions yet.' message will appear, and the Delete History button will be disabled.
es: Ahora si la lista del historial está vacía, aparecerá el mensaje "Aún no hay conversiones" y el botón Borrar Historial se desactivará.
fr: Désormais, si la liste de l'historique est vide, le message ‘Pas encore d'histoire’ apparaîtra et le bouton Supprimer Historique sera désactivé.

source: Policies
es: Políticas
fr: Politiques

source: Privacy Policy
es: Politica de Privacidad
fr: politique de confidentialité

source: Quaternary
es: Quaternaria
fr: Quaternaire

source: Quinary
es: Quinaria
fr: Quinaire

source: Rate this app
es: Califica esta aplicación
fr: Évaluez cette application

source: Report a problem or just send us some feedback.
es: Reporta un problema o simplemente envíanos tus comentarios.
fr: Rapportez un problème ou envoyez-nous simplement des commentaires.

source: Save all your conversions
es: Guarda todas tus conversiones
fr: Enregistrez toutes vos conversions

source: Select a base
es: Selecciona una base
fr: Sélectionnez une base

source: Select a base, enter a number and convert it to any other base. It's just that simple!
es: Selecciona una base, introduce un número y conviértelo a cualquier otra base. ¡Es así de simple!
fr: Sélectionnez une base, saisissez un nombre et convertissez-le dans n'importe quelle autre base. C'est aussi simple que cela !

source: Select a base, tap on the big zero and introduce a number to convert :)
es: Selecciona una base, haz tap sobre el cero grande e introduce un número para convertir :)
fr: Sélectionnez une base, appuyez sur le gros zéro et introduisez un nombre à convertir :)

source: Senary
es: Senaria
fr: Sénaire

source: Support
es: Soporte

source: Support for the most used bases: Binary, Trinary, Quaternary, Quinary, Senary, Octal, Nonary, Decimal, Duodecimal, and Hexadecimal.
es: Soporte para las bases más utilizadas: Binario, Trinario, Cuaternario, Quinario, Senario, Octal, Nonario, Decimal, Duodecimal y Hexadecimal.
fr: Prise en charge des bases les plus utilisées : Binaire, Trinaire, Quaternaire, Quinaire, Sénaire, Octale, Nonaire, Décimale, Duodécimale et Hexadécimale.

source: Take control of you conversions
es: Toma el control de tus conversiones
fr: Prenez le contrôle de vos conversions

source: Terms of Service (EULA)
es: Condiciones de servicio (EULA)
fr: Conditions d'utilisation (CLUF)

source: Ternary
es: Ternaria
fr: Ternaire

source: Version 1.0
es: Versión 1.0

source: Version 1.0.1
es: Versión 1.0.1

source: Version number:
es: Número de versión:
fr: Numéro de version :

source: Warning
es: Aviso
fr: Avertissement

source: Warning!
es: Aviso!
fr: Avertissement!

source: We've made lots of internal code improvements so the app runs faster and smoother.
es: Hemos realizado muchas mejoras en el código interno para que la aplicación se ejecute de forma más rápida y fluida.
fr: Nous avons apporté de nombreuses améliorations au code interne afin que l'application fonctionne plus rapidement et de manière plus fluide.

source: We’ve made some improvements to the history list. Now, the conversions are grouped by year, making it easier to find what you’re looking for.
es: Hemos realizado algunas mejoras en la lista del historial. Ahora, las conversiones están agrupadas por año, lo que hace que sea más fácil encontrar lo que buscas.
fr: Nous avons apporté quelques améliorations à la liste de l’historique. Désormais, les conversions sont regroupées par année, ce qui permet de trouver plus facilement ce que vous recherchez.

source: Welcome to Basebook
es: Te damos la bienvenida a Basebook
fr: Bienvenue sur Basebook

source: What's New
es: Novedades
fr: Nouveautés

source: Zero is zero in all bases, just try another one.
es: Cero es cero en todas las bases, inténtalo con otro.
fr: Zéro est zéro dans toutes les bases, essayez-en simplement une autre.

source: Decimal
fr: Décimal

source: Duodecimal
fr: Duodécimal

source: Hexadecimal
fr: Hexadécimal

source: Octal
fr: Octale
